Learning/C1_TEST_MESH_3_SURFACES/system/blockMeshDict.room
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

// Paper case-study room geometry:
// W x L x H = 4 m x 7 m x 3 m
// Here we use:
// x = length = 7 m  (west -> east)
// y = width  = 4 m
// z = height = 3 m
//
// The paper states openings are on east and west walls,
// but their width/height are to be evaluated.
// So this mesh uses one centered opening on each side as a tunable starting point.

// The vertices use a (X Y Z) coordinate format. The "//" out to the side labels each vertex by a number.
// This vertex label is then used in the blocks section.

vertices
(
    (0    0    0)   // 0
    (0    1.25 0)   // 1
    (0    2.75 0)   // 2
    (0    4    0)   // 3

    (0    0    0.5) // 4
    (0    1.25 0.5) // 5
    (0    2.75 0.5) // 6
    (0    4    0.5) // 7

    (0    0    2.0) // 8
    (0    1.25 2.0) // 9
    (0    2.75 2.0) // 10
    (0    4    2.0) // 11

    (0    0    3.0) // 12
    (0    1.25 3.0) // 13
    (0    2.75 3.0) // 14
    (0    4    3.0) // 15

    (7    0    0)   // 16
    (7    1.25 0)   // 17
    (7    2.75 0)   // 18
    (7    4    0)   // 19

    (7    0    0.5) // 20
    (7    1.25 0.5) // 21
    (7    2.75 0.5) // 22
    (7    4    0.5) // 23

    (7    0    2.0) // 24
    (7    1.25 2.0) // 25
    (7    2.75 2.0) // 26
    (7    4    2.0) // 27

    (7    0    3.0) // 28
    (7    1.25 3.0) // 29
    (7    2.75 3.0) // 30
    (7    4    3.0) // 31
);

// Block are defined here as hexadral blocks (rectangular prisms).
// Three parts to a block:
// First four points (vertices) in the hex defines the bottom face.
// Second four points (vertices) in the hex defines the top face.
// Then the second argument of three points defines the number of cells in the X, Y, and Z directions.
// Then simpleGrading defines the stretching or compression of cells in the X, Y, and Z directions.
// For simpleGrading 1 implies no stretching or compression, i.e. uniform spacing.

blocks
(
    // Blocks 1 through 3.
    hex (0 16 17 1 4 20 21 5)   (70 12 10) simpleGrading (1 1 1)
    hex (1 17 18 2 5 21 22 6)   (70 15 10) simpleGrading (1 1 1)
    hex (2 18 19 3 6 22 23 7)   (70 12 10) simpleGrading (1 1 1)

    // Blocks 4 through 6.
    hex (4 20 21 5 8 24 25 9)   (70 12 30) simpleGrading (1 1 1)
    hex (5 21 22 6 9 25 26 10)  (70 15 30) simpleGrading (1 1 1)
    hex (6 22 23 7 10 26 27 11) (70 12 30) simpleGrading (1 1 1)

    // Blocks 7 through 9.
    hex (8 24 25 9 12 28 29 13)   (70 12 20) simpleGrading (1 1 1)
    hex (9 25 26 10 13 29 30 14)  (70 15 20) simpleGrading (1 1 1)
    hex (10 26 27 11 14 30 31 15) (70 12 20) simpleGrading (1 1 1)
);

// Use edges if there are non-linear segments to be connected in the geometry.

edges
(
);

boundary
(
    westWall
    {
        type wall;
        faces
        (
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)

            (4 8 9 5)
            (6 10 11 7)

            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }

    eastWall
    {
        type wall;
        faces
        (
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)

            (20 21 25 24)
            (22 23 27 26)

            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }

    westOpening
    {
        type patch;
        faces
        (
            (5 9 10 6)
        );
    }

    eastOpening
    {
        type patch;
        faces
        (
            (21 22 26 25)
        );
    }

    southWall
    {
        type wall;
        faces
        (
            (0 16 20 4)
            (4 20 24 8)
            (8 24 28 12)
        );
    }

    northWall
    {
        type wall;
        faces
        (
            (3 7 23 19)
            (7 11 27 23)
            (11 15 31 27)
        );
    }

    floor
    {
        type wall;
        faces
        (
            (0 1 17 16)
            (1 2 18 17)
            (2 3 19 18)
        );
    }

    ceiling
    {
        type wall;
        faces
        (
            (12 28 29 13)
            (13 29 30 14)
            (14 30 31 15)
        );
    }
);

mergePatchPairs
(
);
