Learning/C1_TEST_MESH_3_SURFACES/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location	"system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default         Euler;
    //default         backward;
    //default         CrankNicolson 0.5;
    default		steadyState;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;
	
    default 	     cellLimited leastSquares 1;

    //default 	     cellMDLimited leastSquares 0.5;
    //default 	     cellMDLimited Gauss linear 1;

    grad(U) 	     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss limitedLinearV 1;

    //div(phi,U)      Gauss linearUpwindV default;
    //div(phi,U)      Gauss linearUpwindV grad(U);
    div(phi,U)      Gauss linearUpwind grad(U);

    //div(phi,k)		Gauss linearUpwind default;
    //div(phi,omega)	Gauss linearUpwind default;

    //div(phi,k)	Gauss linear;
    //div(phi,omega)	Gauss linear;

    div(phi,k)		Gauss upwind; //Original
    //div(phi,omega)	Gauss upwind; 

    div(phi,epsilon)	Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{  
     //default         Gauss linear limited 1;
     default		Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         limited 1; // Original
    default		corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
