Learning/C1_TEST_MESH_3_SURFACES/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
   \\    /   O peration     | Website:  https://openfoam.org                                                
    \\  /    A nd           | Version:  13                                                
     \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

all
{
	type	box;
	zoneType	cell;
	
	//Slightly larger than the domain 
	// x -10m to +30m, y -2.5m to +2.5m, z -2.5m to +2.5m
	box	(-11 -3 -3) (31 3 3);
}

// ************************************************************************* //

